#Область ПрограммныйИнтерфейс

// Объединяет несколько документов в формате pdf в один документ.
// Документы объединяются в порядке их следования в переданном массиве.
//
// Параметры:
//  ОбъединяемыеДокументы - Массив из ДвоичныеДанные - массив файлов для объединения
//
// Возвращаемое значение:
//  ДвоичныеДанные - результат объединения
Функция ОбъединитьДокументы(ОбъединяемыеДокументы) Экспорт

КонецФункции

// Создает новый документ из страниц переданного документа.
// Страницы передаются в виде строки с перечислением номеров страниц через запятую. Страницы в новом документе
// соблюдают переданный порядок. Страницы могут повторяться. Если страница с переданным номером не существует,
// будет выброшено исключение.
//
// Параметры:
//  ДокументИсточник - ДвоичныеДанные - документ из которого могут выбираться страницы
//  Страницы - Строка - строка с перечислением номер страниц. Например "1,2,1,4"
//
// Возвращаемое значение:
//  ДвоичныеДанные - результирующий докуемент
Функция НовыйДокументИзСтраниц(ДокументИсточник, Страницы) Экспорт

КонецФункции

// Возвращает количество страниц в документе.
//
// Параметры:
//  Документ - ДвоичныеДанные - документ, количество страниц которого нужно получить
//
// Возвращаемое значение:
//  Число - количество страниц
Функция КоличествоСтраниц(Документ) Экспорт

КонецФункции

#КонецОбласти
